{
  "portfolio": [
    {
      "id": 1,
      "name": "Smile Pet Shop",
      "tag": "Web",
      "category": "E-commerce / B2B & B2C",
      "image": "/Projetos/SmilePetShop.png",
      "importance": "1",
      "deploy_link": "https://www.smilepetshop.com.br/",
      "repo_link": "https://github.com/MxSGameJPS/smilepetshop",
      "repo_link_API": "https://github.com/MxSGameJPS/apismilepet",
      "description": "Uma plataforma de comércio eletrônico robusta desenvolvida sob medida para o nicho de Pet Shop. O projeto vai além de uma simples loja virtual, integrando fluxos complexos de venda para Varejo (B2C) e Atacado (B2B), com gestão completa via painel administrativo e conexão em tempo real com sistemas externos.",
      "sections": [
        {
          "title": "Responsividade: Experiência Fluida em Qualquer Tela",
          "content": "Em um mercado onde a maioria das compras começa no celular, a adaptabilidade não é opcional. O SmilePetShop foi arquitetado com uma interface totalmente responsiva, garantindo que a navegação seja intuitiva e sem atritos, seja em um smartphone, tablet ou desktop. O layout se ajusta dinamicamente para preservar a legibilidade e a facilidade de compra, focando na retenção do usuário móvel."
        },
        {
          "title": "Exclusividade em cada pixel (Funcionalidades Customizadas)",
          "content": "Personalização é a chave deste projeto. Diferente de templates genéricos, desenvolvi regras de negócio específicas: Módulos Híbridos (Áreas de login e catálogo distintos para clientes finais e revendedores/Atacado); Integrações Reais (Conexão direta com ERP Bling para gestão de estoque e Mercado Pago para checkouts transparentes); Engajamento (Sistema próprio de avaliações, listas de desejos e funcionalidades sazonais)."
        },
        {
          "title": "Performance com Tecnologia de Ponta",
          "content": "Construído sobre a modernidade do React 19 e Vite, o projeto entrega uma navegação ultra-rápida (SPA). O foco em otimização de código e componentes modulares assegura tempos de carregamento mínimos, essenciais para o SEO e para a conversão de vendas. No back-end, a arquitetura em Node.js com PostgreSQL garante segurança e estabilidade."
        },
        {
          "title": "Backend Robusto e Orientado a Processos",
          "content": "Desenvolvido sobre a infraestrutura moderna do Next.js (API Routes), o sistema gerencia regras de negócio complexas com eficiência. Implementei scripts de automação para tarefas críticas, como verificação de pagamentos, sincronização de notas fiscais (NF-e) e auditoria de pedidos. A arquitetura é preparada para escalar, utilizando conexões otimizadas com PostgreSQL."
        },
        {
          "title": "Ecossistema Conectado (Integrações)",
          "content": "O Smile PetShop atua como um hub centralizador. O backend orquestra comunicações síncronas e assíncronas com múltiplos serviços externos: Mercado Pago (Pagamentos), Bling ERP (Fiscal/Logística), Resend (E-mail transacional) e Cloudinary/Vercel Blob (Mídia)."
        }
      ],
      "tech_stack": [
        "Front-end: React 19",
        "Build Tool: Vite",
        "Estilização: CSS Modules",
        "Rotas: React Router Dom (v7)",
        "Back-end Framework: Next.js (API Routes / Serverless)",
        "Database: PostgreSQL (via pg driver)",
        "Autenticação: JWT & Bcryptjs",
        "Pagamentos: SDK Mercado Pago",
        "Storage: Cloudinary & Vercel Blob",
        "E-mail: Resend",
        "Documentação: Swagger UI",
        "Ferramentas Extras: jsPDF & AutoTable"
      ]
    },
    {
      "id": 2,
      "name": "Ai2Love",
      "tag": "Web",
      "category": "SaaS / IA Conversacional",
      "image": "/Projetos/Ai2Love.png",
      "importance": "1",
      "deploy_link": "https://ai2love.vercel.app/",
      "repo_link": "https://github.com/MxSGameJPS/ai2love",
      "description": "Uma plataforma imersiva de relacionamento virtual impulsionada por Inteligência Artificial. O Ai2Love oferece conexões significativas através de parceiros virtuais personalizados, utilizando algoritmos avançados para criar diálogos naturais, empáticos e envolventes em tempo real.",
      "sections": [
        {
          "title": "Responsividade: Imersão Total em Qualquer Dispositivo",
          "content": "Para um produto onde a intimidade e a conversa são o foco, a interface precisa desaparecer. Desenvolvi uma UX 'Mobile-First' que prioriza a área de chat e a interação visual com os avatares. Seja no desktop ou no celular, a aplicação entrega uma experiência fluida, com transições suaves (via Framer Motion) e layouts adaptativos."
        },
        {
          "title": "Design Emocional e Reativo",
          "content": "Cada detalhe visual foi pensado para evocar emoção. O projeto utiliza Feedback Visual Natural (Animações sutis que simulam o 'pensar' da IA), Partículas Dinâmicas (tsparticles para criar ambientes visuais vivos) e um Modo Fallback Inteligente (garante funcionalidade mesmo se a API principal oscilar)."
        },
        {
          "title": "Performance: Arquitetura Escalável Next.js",
          "content": "Engenharia robusta construída com Next.js 14 e TypeScript. A tipagem estática garante um código blindado a erros. O sistema conta com WebSocket/SignalR para comunicação em tempo real de baixa latência e otimização de assets. Integração profunda com APIs para autenticação e processamento de pagamentos."
        }
      ],
      "tech_stack": [
        "Framework: Next.js 14 (App Router)",
        "Linguagem: TypeScript",
        "Estilização: Tailwind CSS",
        "Animações: Framer Motion",
        "Real-Time: Microsoft SignalR (WebSockets)",
        "Efeitos Visuais: TSParticles",
        "Renderização Chat: React Markdown",
        "Testes: Jest & React Testing Library"
      ]
    },
    {
      "id": 3,
      "name": "FDMC API (Base Architecture)",
      "tag": "API - BackEnd",
      "category": "Backend as a Service / Boilerplate Escalável",
      "image": "/Projetos/FDMCapi.png",
      "importance": "1",
      "deploy_link": "https://fdmc-api.vercel.app/",
      "repo_link": "https://github.com/MxSGameJPS/fdmc-api",
      "description": "Uma fundação arquitetural moderna projetada para escalar. Este projeto serve como o esqueleto robusto para aplicações de alta performance, integrando nativamente o poder do Next.js 15 (com Turbopack e App Router) e a versatilidade do Supabase para gerenciamento de dados em tempo real e autenticação.",
      "sections": [
        {
          "title": "Performance Nativa e DX Superior",
          "content": "Construído pensando na velocidade de desenvolvimento e de execução. Utilizando o novo Turbopack do Next.js, o ambiente de desenvolvimento é instantâneo. A estrutura adota o App Router e Server Components por padrão, entregando apenas o HTML essencial para o cliente."
        },
        {
          "title": "Exclusividade: Backend Serverless e Real-Time (Supabase)",
          "content": "Integração nativa com o Supabase oferecendo Autenticação Pronta (gestão de usuários), Database em Tempo Real (Live Updates com PostgreSQL) e Edge Functions (lógica de negócio na borda)."
        },
        {
          "title": "Padronização (Code Quality)",
          "content": "Qualidade mantida através de TypeScript rigoroso e ESLint. Para a interface, utiliza Tailwind CSS v4 permitindo construção de layouts complexos sem sair do HTML."
        }
      ],
      "tech_stack": [
        "Framework: Next.js 15.4 (Latest)",
        "Build Tool: Turbopack",
        "Linguagem: TypeScript 5",
        "Backend/DB: Supabase JS SDK",
        "Estilização: Tailwind CSS v4",
        "Linter: ESLint 9"
      ]
    },
    {
      "id": 4,
      "name": "Fogão do Meu Coração (FDMC)",
      "tag": "Mobile",
      "category": "Mobile App (iOS & Android) / Agregador de Conteúdo",
      "image": "/Projetos/FDMCAPP.png",
      "importance": "2",
      "deploy_link": "https://play.google.com/store/apps/details?id=com.mxsgamejps.fogaodomeucoracao&pcampaignid=web_share",
      "repo_link": "https://github.com/MxSGameJPS/fdmc",
      "description": "Mais do que um aplicativo informativo, um ecossistema digital para o torcedor apaixonado. O FDMC centraliza notícias em tempo real, tabelas de campeonatos, mapas de estádios e interatividade, transformando a paixão pelo clube em uma experiência digital diária.",
      "sections": [
        {
          "title": "Responsividade: Design Nativo e Adaptativo",
          "content": "Desenvolvido com React Native e Expo SDK 53, entrega uma experiência 100% nativa. A interface utiliza o Expo Router para navegação profunda e fluida, com layouts que se adaptam perfeitamente desde telas menores até grandes displays, utilizando Safe Area Context."
        },
        {
          "title": "Exclusividade & Features: Conexão Real com o Torcedor",
          "content": "Recursos avançados incluem Push Notifications Inteligentes (Firebase Cloud Messaging), Agregação de Conteúdo (Robôs com node-html-parser e rss-parser) e Navegação Geográfica (Integração com Mapas)."
        },
        {
          "title": "Performance: Otimização Extrema",
          "content": "Uso do Reanimated 3 permite animações a 60fps na thread de UI. Imagens são cacheadas com Expo Image e o armazenamento local (AsyncStorage) garante funcionamento offline."
        }
      ],
      "tech_stack": [
        "Core: React Native 0.76 + Expo SDK 53",
        "Roteamento: Expo Router (v5)",
        "Linguagem: TypeScript",
        "Push/Analytics: Firebase",
        "Mapas: React Native Maps",
        "Scraping: Node HTML Parser",
        "Requisições: Axios",
        "Datas: Moment.js",
        "Mídia: Expo AV"
      ]
    },
    {
      "id": 5,
      "name": "Vida Leve",
      "tag": "Mobile",
      "category": "Saúde & Bem-estar (Health Tech)",
      "image": "/Projetos/vidaleve.png",
      "importance": "1",
      "deploy_link": "https://play.google.com/store/apps/details?id=com.vidaleve.app&pcampaignid=web_share",
      "repo_link": "https://github.com/MxSGameJPS/vida-leve",
      "description": "Um assistente pessoal de saúde no bolso. O aplicativo Vida Leve foi projetado para simplificar o acompanhamento da rotina saudável, permitindo o registro e monitoramento de atividades físicas, ingestão de água e metas diárias, transformando dados em insights visuais.",
      "sections": [
        {
          "title": "Responsividade & Visualização de Dados",
          "content": "Integração da biblioteca react-native-chart-kit para criar gráficos dinâmicos. A interface utiliza navegação por abas (@react-navigation/bottom-tabs) e pilhas, garantindo ergonomia em qualquer tamanho de tela."
        },
        {
          "title": "Exclusividade: Offline First",
          "content": "Arquitetura Offline-First utilizando AsyncStorage para persistir dados localmente. Implementação de Notificações Locais (expo-notifications) e Feedback Sensorial com expo-av."
        },
        {
          "title": "Performance & Integração em Nuvem",
          "content": "Conexão com Firebase para sincronização e autenticação. Uso de NetInfo para monitorar o estado da rede e gerenciar inteligentemente o envio de dados, economizando bateria e dados móveis."
        }
      ],
      "tech_stack": [
        "Core: React Native + Expo 53",
        "Navegação: React Navigation v6",
        "Gráficos: React Native Chart Kit",
        "Storage Local: AsyncStorage",
        "Backend (BaaS): Firebase Integration",
        "Notificações: Expo Notifications",
        "Conectividade: NetInfo"
      ]
    },
    {
      "id": 6,
      "name": "Barbearia",
      "tag": "Web",
      "category": "Web App Institucional / Agendamento",
      "image": "/Projetos/barbearia.png",
      "importance": "2",
      "deploy_link": "https://barbearia-three-teal.vercel.app/",
      "repo_link": "https://github.com/MxSGameJPS/barbearia",
      "description": "Redefinindo a presença digital para serviços de estética masculina. Desenvolvido para oferecer uma experiência de agendamento e descoberta de serviços que reflete a qualidade premium do estabelecimento, utilizando as tecnologias web mais avançadas.",
      "sections": [
        {
          "title": "Responsividade & Estética (Design System)",
          "content": "Identidade visual forte baseada na fonte Poppins. Utilizando Tailwind CSS v4, o layout é totalmente responsivo, adaptando-se de monitores ultrawide a smartphones."
        },
        {
          "title": "Exclusividade: Agilidade na Navegação",
          "content": "Single Page Application otimizada pelo Next.js 15. SEO Otimizado com metadados dinâmicos e Gestão de Estado via cookies-next para gerenciar sessões de forma leve."
        },
        {
          "title": "Performance: Velocidade é Respeito ao Cliente",
          "content": "Arquitetura Server-Side Rendering (SSR) do Next.js entrega conteúdo pronto, resultando em FCP extremamente baixo e pontuações altas no Lighthouse."
        }
      ],
      "tech_stack": [
        "Core: Next.js 15.2 (Bleeding Edge)",
        "Linguagem: TypeScript 5",
        "Estilização: Tailwind CSS v4",
        "Fontes: next/font (Poppins)",
        "Cookies: cookies-next",
        "Ícones: React Icons"
      ]
    },
    {
      "id": 7,
      "name": "DJ Moisés - Official Website",
      "tag": "Web",
      "category": "Landing Page Artística / Entretenimento",
      "image": "/Projetos/djmoises.png",
      "importance": "2",
      "deploy_link": "https://dj-moises.vercel.app/",
      "repo_link": "https://github.com/MxSGameJPS/dj-moises",
      "description": "Mais do que um site, uma extensão da pista de dança. Combinando estética vibrante com performance técnica, o site serve como hub central para agenda de shows, press kit e streaming de sets.",
      "sections": [
        {
          "title": "Responsividade & Visual (UI/UX)",
          "content": "Utilizando React 19 e Mantine, a interface é polida e altamente responsiva. O design utiliza um sistema de cores dinâmico (styled-components) que reflete a identidade visual noturna do DJ."
        },
        {
          "title": "Exclusividade: Arquitetura Moderna SPA",
          "content": "SPA que elimina recarregamentos desnecessários. Roteamento Ágil com React Router v7 e Design System Consistente unindo Mantine UI com customizações CSS-in-JS."
        },
        {
          "title": "Performance: Alta Fidelidade e Velocidade",
          "content": "Estruturado sobre o Vite para máxima velocidade. A arquitetura modular garante que apenas o código necessário seja carregado."
        }
      ],
      "tech_stack": [
        "Core: React 19 + Vite",
        "UI Framework: @mantine/core",
        "Estilização: styled-components",
        "Navegação: React Router v7",
        "Ícones: React Icons"
      ]
    },
    {
      "id": 8,
      "name": "QFarma Digital",
      "tag": "Web",
      "category": "Portal de Saúde / Farmácia de Serviços",
      "image": "/Projetos/qfarma.png",
      "importance": "1",
      "deploy_link": "https://farmaciaqfarma.vercel.app/",
      "repo_link": "https://github.com/MxSGameJPS/farmaciaqfarma",
      "description": "Saúde ao alcance de um clique. A plataforma destaca a expertise farmacêutica através de um design limpo e acolhedor, facilitando o acesso a informações críticas sobre vacinas, horários e serviços.",
      "sections": [
        {
          "title": "Responsividade & UX (Saúde Móvel)",
          "content": "Utilizando CSS Modules e Design Tokens globais, a interface mantém a integridade visual e legibilidade em qualquer dispositivo. Navegação intuitiva guiando o paciente para áreas vitais."
        },
        {
          "title": "Exclusividade: Foco na Experiência do Paciente",
          "content": "Módulo de Vacinas detalhado, Prova Social Dinâmica (Depoimentos) e Interatividade Visual com cards interativos."
        },
        {
          "title": "Performance: Velocidade Turbo (Next.js 15)",
          "content": "Construído com Next.js 15 e Turbopack. Renderização híbrida (Server Components) garante indexação perfeita (SEO) e transições instantâneas."
        }
      ],
      "tech_stack": [
        "Framework: Next.js 15.5",
        "Linguagem: JavaScript (React 19)",
        "Estilização: CSS Modules",
        "Ícones: React Icons",
        "Arquitetura: App Router"
      ]
    },
    {
      "id": 9,
      "name": "ClinicaMedica App",
      "tag": "Mobile",
      "category": "Health Tech / Super App de Saúde",
      "image": "/Projetos/clinicamedicaAPP.png",
      "importance": "1",
      "deploy_link": "https://clinicasmedicas.vercel.app/",
      "repo_link": "",
      "description": "A saúde na palma da mão, sem complicações. Ponto único de contato entre pacientes e serviços de saúde, com jornada desenhada desde o onboard educativo até agendamento e compra de medicamentos.",
      "sections": [
        {
          "title": "Arquitetura de Navegação Customizada",
          "content": "Implementação de navegação baseada em estado (useState) para controle granular e transições personalizadas, garantindo que o contexto do paciente nunca se perca."
        },
        {
          "title": "Ecossistema Completo de Saúde",
          "content": "Integra Telemedicina (Chat em tempo real), Gestão de Tratamento (Prontuário/Consultas), Marketplace Farmacêutico e fluxos dedicados de Segurança e Privacidade."
        },
        {
          "title": "UX & Design System",
          "content": "Design limpo com componentes reutilizáveis. Uso intensivo de SafeAreaContext e vetores SVG para compatibilidade e nitidez em qualquer resolução."
        }
      ],
      "tech_stack": [
        "Core: React Native 0.81 + Expo 54",
        "Gestão de Estado: React Context API + Hooks",
        "Interface: React Native SVG + Linear Gradient",
        "Armazenamento: Async Storage",
        "Assets: Expo Font"
      ]
    },
    {
      "id": 10,
      "name": "ClinicaMedica Admin Web",
      "tag": "Web",
      "category": "Painel Administrativo / Sistema de Gestão ERP",
      "image": "/Projetos/clinicamedicaWEB.png",
      "importance": "1",
      "deploy_link": "https://clinicamedica-mu.vercel.app/",
      "repo_link": "https://github.com/MxSGameJPS/clinicamedica",
      "description": "O centro de comando da clínica. Dashboard robusto para gestão de médicos, agendamentos, pacientes e relatórios financeiros, permitindo visão macro e micro da operação.",
      "sections": [
        {
          "title": "Arquitetura Moderna e Futurista (Next.js 16)",
          "content": "Desenvolvido com a versão beta/avançada do Next.js 16, explorando Server Components e otimizações de performance. Estrutura modular simplificada."
        },
        {
          "title": "Confiabilidade e Testes (QA)",
          "content": "Cultura de testes forte utilizando Jest e React Testing Library para testes unitários e de integração, garantindo que regras de negócio funcionem antes da produção."
        },
        {
          "title": "Integração e Marketing",
          "content": "Inclui Landing page moderna integrada ao mesmo repositório, unificando identidade visual desde o anúncio até o gerenciamento interno."
        }
      ],
      "tech_stack": [
        "Framework: Next.js 16.1",
        "Linguagem: JavaScript Moderno (React 19)",
        "Testes: Jest + React Testing Library",
        "Estilização: CSS Modules",
        "CI/CD: Configuração pronta para pipelines"
      ]
    },
    {
      "id": 11,
      "name": "Lume",
      "tag": "Mobile",
      "category": "Produtividade / Gamification",
      "image": "/Projetos/lume.png",
      "importance": "1",
      "deploy_link": "https://lume-seven-theta.vercel.app/",
      "repo_link": "https://github.com/MxSGameJPS/lume",
      "description": "Organizador pessoal gamificado que transforma a rotina em um RPG da vida real. Utiliza conceitos de XP, Níveis e Streaks para incentivar a conclusão de objetivos diários.",
      "sections": [
        {
          "title": "Backend Integrado & Gamificação (Supabase)",
          "content": "Lógica de jogo processada no banco de dados via triggers SQL e Supabase, garantindo sincronização segura de progresso entre dispositivos."
        },
        {
          "title": "UX & Engajamento",
          "content": "Feedback tátil (expo-haptics) e visual para celebrar tarefas concluídas. Notificações Inteligentes para manter a ofensiva (streak)."
        },
        {
          "title": "Autenticação & Segurança",
          "content": "Login Social com Google e autenticação via Supabase Auth. Segurança garantida por RLS (Row Level Security)."
        }
      ],
      "tech_stack": [
        "Core: React Native + Expo 54 + Expo Router v6",
        "Backend/DB: Supabase (Auth, DB, Realtime, Triggers)",
        "Integrações: Google Sign-In, Expo Notifications",
        "UI: Expo Font, Expo Linear Gradient"
      ]
    },
    {
      "id": 12,
      "name": "Espaço Zen",
      "tag": "Web",
      "category": "Landing Page de Serviços / Bem-Estar",
      "image": "/Projetos/espacozen.png",
      "importance": "2",
      "deploy_link": "https://gleicetorres.vercel.app/",
      "repo_link": "https://github.com/MxSGameJPS/gleicetorres",
      "description": "Landing Page desenhada para traduzir a tranquilidade e profissionalismo de um estúdio de massoterapia, com foco total em conversão e agendamento.",
      "sections": [
        {
          "title": "Arquitetura Leve (SPA)",
          "content": "Todo o conteúdo vital reside em uma única rolagem contínua. Graças ao Vite 7, o site carrega instantaneamente."
        },
        {
          "title": "Estilização Modular (Styled Components)",
          "content": "Uso de Styled Components para encapsular CSS e criar um Theming System dinâmico."
        },
        {
          "title": "Call-to-Action Estratégico",
          "content": "Botões de CTA estrategicamente posicionados e botão flutuante do WhatsApp para maximizar conversão."
        }
      ],
      "tech_stack": [
        "Build Tool: Vite 7.0",
        "UI Library: React 19",
        "Estilização: Styled Components",
        "Ícones: React Icons",
        "SEO: Otimizado para Negócios Locais"
      ]
    },
    {
      "id": 13,
      "name": "Confeitaria API Service",
      "tag": "API - BackEnd",
      "category": "Backend Serverless / REST API",
      "image": "/Projetos/ConfeitariaAPIService.png",
      "importance": "1",
      "deploy_link": "https://api-confeitaria.vercel.app/index.html",
      "repo_link": "https://github.com/MxSGameJPS/api-confeitaria",
      "description": "API que serve como coração digital para e-commerce de confeitaria, gerenciando catálogo, pedidos e dados de clientes. Construída para ser rápida, escalável e serverless.",
      "sections": [
        {
          "title": "Arquitetura Serverless (Vercel)",
          "content": "Roda em modelo Serverless na infraestrutura da Vercel, escalando automaticamente conforme a demanda."
        },
        {
          "title": "Banco de Dados em Nuvem (Neon DB)",
          "content": "Utiliza Neon DB (PostgreSQL Serverless) com conexão otimizada para ambientes sem servidor."
        },
        {
          "title": "Simplicidade e Integração (CORS)",
          "content": "Middleware CORS configurado para permitir consumo por diversas interfaces. Respostas JSON padronizadas."
        }
      ],
      "tech_stack": [
        "Runtime: Node.js",
        "Framework: Express.js",
        "Database: PostgreSQL (Neon Serverless)",
        "Driver: pg (node-postgres)",
        "Deploy: Vercel"
      ]
    },
    {
      "id": 14,
      "name": "Garçom Digital com IA",
      "tag": "Web",
      "category": "Cardápio Digital / Chatbot AI",
      "image": "/Projetos/gracomdigital.png",
      "importance": "2",
      "deploy_link": "",
      "repo_link": "https://github.com/MxSGameJPS/confeitaria-sonho-meu",
      "description": "Revoluciona a experiência de pedir integrando cardápio digital com Garçom Virtual Inteligente (Google Gemini), permitindo pedidos e recomendações via chat.",
      "sections": [
        {
          "title": "Inovação: Atendimento Humanizado por IA",
          "content": "Chat Interface alimentado por IA que entende contexto e sugere harmonizações."
        },
        {
          "title": "Arquitetura Híbrida (Cliente x Admin)",
          "content": "Aplicação Dual-Mode: interface limpa para clientes e Painel Administrativo para gestores na mesma aplicação."
        },
        {
          "title": "Design System Temático",
          "content": "Paleta de cores e design responsivo focados em evocar apetite e conforto."
        }
      ],
      "tech_stack": [
        "Core: React 19 + Vite 6.2",
        "AI Engine: Google Generative AI SDK (Gemini)",
        "Linguagem: TypeScript 5.8",
        "Gestão de Estado: Context API",
        "Estilo: CSS Customizado"
      ]
    },
    {
      "id": 15,
      "name": "Rafael Psicologia",
      "tag": "Web",
      "category": "Saúde Mental / Landing Page Profissional",
      "image": "",
      "importance": "",
      "deploy_link": "",
      "repo_link": "",
      "description": "Espaço digital de acolhimento desenhado para transmitir calma, segurança e profissionalismo, encorajando o visitante a buscar ajuda.",
      "sections": [
        {
          "title": "Arquitetura Orientada a Componentes",
          "content": "Estrutura modular baseada em features para manutenção simplificada."
        },
        {
          "title": "UX para Conversão",
          "content": "Jornada otimizada com CTAs claros e formulário integrado via Formspree."
        },
        {
          "title": "Performance e SEO",
          "content": "Construído com Vite 6 e React 19 para performance excepcional e experiência visual estável."
        }
      ],
      "tech_stack": [
        "Core: React 19 + Vite 6.3",
        "Estilização: Styled Components",
        "Formulários: Formspree React",
        "Componentes: React Icons",
        "Organização: Modular (Feature-based)"
      ]
    },
    {
      "id": 16,
      "name": "Fokus App",
      "tag": "Mobile",
      "category": "Produtividade / Pomodoro com Música",
      "image": "/Projetos/fokus.png",
      "importance": "1",
      "deploy_link": "https://play.google.com/store/apps/details?id=com.mxsgamejps.fokusApp&pcampaignid=web_share",
      "repo_link": "https://github.com/MxSGameJPS/fokus-app",
      "description": "Ferramenta de produtividade que combina técnica Pomodoro com curadoria de músicas. Destaque para o reprodutor de áudio resiliente à prova de falhas.",
      "sections": [
        {
          "title": "Engenharia de Áudio Avançada",
          "content": "Camada de abstração sobre expo-av com Smart Fallback para fontes de áudio e conversão em tempo real de links do Drive."
        },
        {
          "title": "New Architecture Ready",
          "content": "Configurado com newArchEnabled para habilitar Fabric Renderer e TurboModules."
        },
        {
          "title": "UX e Detalhes",
          "content": "Controles de reprodução completos, suporte a Tablets e gestão de permissões críticas de Android."
        }
      ],
      "tech_stack": [
        "Core: React Native 0.79 + Expo 53 (New Architecture)",
        "Mídia: Expo AV + Expo Audio",
        "Background: Expo Background Fetch + Task Manager",
        "Armazenamento: Firebase Storage + Firestore",
        "Navegação: Expo Router v5"
      ]
    },
    {
      "id": 17,
      "name": "NextPath",
      "tag": "Web",
      "category": "EdTech / Gamified Learning Platform",
      "image": "/Projetos/nextpatch.png",
      "importance": "1",
      "deploy_link": "https://nextpath-eight.vercel.app/",
      "repo_link": "https://github.com/MxSGameJPS/nextpath",
      "description": "Plataforma educacional gamificada para ensino de tecnologias web com desafios de código, tutoriais e sistema de ranking global.",
      "sections": [
        {
          "title": "Gamificação e Engajamento",
          "content": "Motor de gamificação próprio com Gemas, XP e Ranking Global em tempo real."
        },
        {
          "title": "Internacionalização e Escalabilidade",
          "content": "Suporte a i18n para múltiplos idiomas e estrutura modular."
        },
        {
          "title": "Performance e Banco de Dados",
          "content": "Next.js 15 com Renderização Híbrida e conexões Serverless otimizadas com Neon Cloud."
        }
      ],
      "tech_stack": [
        "Core: Next.js 15.5 + React 19",
        "Database: PostgreSQL (Neon Serverless)",
        "Driver: Node-Postgres (pg)",
        "Internacionalização: i18n Customizado",
        "Deploy: Vercel",
        "Design: CSS Modules"
      ]
    },
    {
      "id": 18,
      "name": "Freela Control",
      "tag": "Web",
      "category": "SaaS (B2B) / Gestão Financeira",
      "image": "/Projetos/frellacontrol.png",
      "importance": "2",
      "deploy_link": "https://freela-control.vercel.app/",
      "repo_link": "https://github.com/MxSGameJPS/freela-control",
      "description": "Sistema operacional do Freelancer moderno para gestão de clientes, projetos e fluxo de caixa na nuvem.",
      "sections": [
        {
          "title": "Arquitetura Serverless e Banco de Dados",
          "content": "Next.js 15 e Neon Database (PostgreSQL Serverless) para escalabilidade."
        },
        {
          "title": "Autenticação Segura (JWT)",
          "content": "Sistema proprietário de autenticação via JWT, Bcrypt e Middlewares de proteção de rotas."
        },
        {
          "title": "Dashboards e Visualização de Dados",
          "content": "Integração com Chart.js para Business Intelligence e visualização de dados financeiros."
        }
      ],
      "tech_stack": [
        "Core: Next.js 15.5 + React 19",
        "Database: Neon (PostgreSQL Serverless)",
        "Auth: JWT + Bcrypt + Cookie Seguro",
        "Analytics: Chart.js",
        "Estilização: CSS Modules"
      ]
    },
    {
      "id": 19,
      "name": "Retrospectiva Dev (Git Wrapped Clone)",
      "tag": "Web",
      "category": "Viral App / Data Visualization",
      "image": "/Projetos/retrospectivas.png",
      "importance": "2",
      "deploy_link": "https://retrospectivas-phi.vercel.app/",
      "repo_link": "https://github.com/MxSGameJPS/retrospectivas",
      "description": "Transforma dados de commits do GitHub em uma experiência visual estilo 'Stories' para compartilhamento social.",
      "sections": [
        {
          "title": "UX Interativa e Animação",
          "content": "Transições fluidas com Framer Motion e player de áudio integrado."
        },
        {
          "title": "Funcionalidade Social (Viralidade)",
          "content": "Exportação de resultados como imagens de alta qualidade via html-to-image."
        },
        {
          "title": "Performance e Tecnologia",
          "content": "Next.js 16 e React 19 explorando capacidades de servidor para busca de dados na API do GitHub."
        }
      ],
      "tech_stack": [
        "Framework: Next.js 16.1 + React 19",
        "Animação: Framer Motion",
        "Exportação: HTML-to-Image / HTML2Canvas",
        "Áudio: Howler.js",
        "API: GitHub REST API",
        "Design: CSS Modules + Lucide React"
      ]
    },
    {
      "id": 20,
      "name": "Slim Shape API",
      "tag": "API - BackEnd",
      "category": "Serverless API / Media Management",
      "image": "/Projetos/slimshape-api.png",
      "importance": "1",
      "deploy_link": "https://slimshapeapi.vercel.app/swagger.html",
      "repo_link": "https://github.com/MxSGameJPS/slimshapeapi",
      "description": "API RESTful desenvolvida para o ecossistema Slim Shape Digital, focada em alta performance serverless e gerenciamento otimizado de ativos digitais.",
      "sections": [
        {
          "title": "Arquitetura Serverless e Dados",
          "content": "Backend hospedado na Vercel com conexão otimizada ao Neon Database (PostgreSQL) para escalabilidade instantânea."
        },
        {
          "title": "Gerenciamento de Mídia",
          "content": "Integração robusta com Cloudinary utilizando Formidable para processamento eficiente de uploads e otimização de imagens."
        },
        {
          "title": "Modernização e Documentação",
          "content": "Construído sobre Express 5 (versão mais recente) para melhor tratamento de assincronicidade e documentado via Swagger."
        }
      ],
      "tech_stack": [
        "Framework: Express.js 5.1",
        "Banco de Dados: PostgreSQL (Neon) + pg",
        "Storage / Mídia: Cloudinary + Formidable",
        "Infraestrutura: Vercel Serverless Functions",
        "Utilitários: Axios + Dotenv",
        "Documentação: Swagger UI"
      ]
    },
    {
      "id": 21,
      "name": "Slim Shape (Web)",
      "tag": "Web",
      "category": "Health Tech / Dashboard",
      "image": "/Projetos/slimshape-web.png",
      "importance": "1",
      "deploy_link": "https://slimshape-three.vercel.app/",
      "repo_link": "https://github.com/MxSGameJPS/slimshape",
      "description": "Interface web progressiva para a plataforma Slim Shape, focada no monitoramento de saúde através de dashboards interativos e tecnologia de ponta.",
      "sections": [
        {
          "title": "Bleeding Edge Tech",
          "content": "Desenvolvido com as versões mais recentes do Next.js 15 e React 19, utilizando Turbopack para máxima performance de build."
        },
        {
          "title": "Visualização de Dados",
          "content": "Implementação de dashboards analíticos com Chart.js para transformar métricas de evolução física em gráficos intuitivos."
        },
        {
          "title": "Arquitetura Componentizada",
          "content": "Estrutura modular limpa consumindo a API Serverless, focada em manutenibilidade e escalabilidade."
        }
      ],
      "tech_stack": [
        "Core: Next.js 15.5 (Turbopack)",
        "Library: React 19.1",
        "Data Viz: Chart.js + React-Chartjs-2",
        "Icons: React Icons",
        "Qualidade: ESLint + TypeScript Types",
        "Design: CSS Modules"
      ]
    },
    {
      "id": 22,
      "name": "Smile Pet API",
      "tag": "API - BackEnd",
      "category": "E-commerce API / FinTech",
      "image": "/Projetos/smilepet-api.png",
      "importance": "1",
      "deploy_link": "https://apismilepet.vercel.app/swagger",
      "repo_link": "https://github.com/MxSGameJPS/apismilepet",
      "description": "API completa para e-commerce de produtos e serviços pet, integrando pagamentos, gestão de usuários e processamento de dados em massa.",
      "sections": [
        {
          "title": "Ecossistema Financeiro",
          "content": "Integração nativa com Mercado Pago para processamento seguro de pagamentos e checkout transparente."
        },
        {
          "title": "Segurança e Comunicação",
          "content": "Autenticação robusta via JWT/Bcrypt e sistema de e-mails transacionais automatizados utilizando Resend."
        },
        {
          "title": "Gestão de Dados Híbrida",
          "content": "Arquitetura versátil combinando PostgreSQL para dados relacionais, LowDB para estruturas leves e CSV-Parser para importação em massa de produtos."
        },
        {
          "title": "Armazenamento Multi-Cloud",
          "content": "Estratégia de mídia distribuída utilizando tanto Vercel Blob quanto Cloudinary para otimização de assets."
        }
      ],
      "tech_stack": [
        "Framework: Next.js 15 (API Routes)",
        "Pagamentos: Mercado Pago SDK",
        "Database: PostgreSQL + LowDB + Node-Cache",
        "Email Service: Resend",
        "Storage: Vercel Blob + Cloudinary",
        "Auth: JWT + BcryptJS",
        "Data Processing: CSV-Parser + Multer",
        "Docs: Swagger UI"
      ]
    },
    {
      "id": 23,
      "name": "Lughs Word",
      "tag": "Web",
      "category": "Institutional / Global SPA",
      "image": "/Projetos/lughs-word.png",
      "importance": "2",
      "deploy_link": "https://lughs.vercel.app/",
      "repo_link": "https://github.com/MxSGameJPS/lughs",
      "description": "Single Page Application de alto padrão focada em experiência global e apresentação visual imersiva.",
      "sections": [
        {
          "title": "Internacionalização (i18n)",
          "content": "Arquitetura preparada para alcance global com suporte multi-idiomas nativo utilizando i18next e detecção automática de linguagem."
        },
        {
          "title": "Interface Premium (MUI 7)",
          "content": "Construído sobre a versão mais recente do Material UI (v7), garantindo componentes acessíveis e design system consistente."
        },
        {
          "title": "Interatividade Visual",
          "content": "Combinação poderosa de Framer Motion para animações de micro-interação e múltiplos sistemas de carrossel (Swiper e Embla) para showcase."
        }
      ],
      "tech_stack": [
        "Core: React 19 + React Scripts (CRA)",
        "UI Library: Material UI (MUI) v7",
        "Estilização: Styled-components + Emotion",
        "Localization: React-i18next",
        "Motion: Framer Motion",
        "Components: Swiper JS + Embla Carousel",
        "QA: React Testing Library"
      ]
    }
  ]
}
